early-init.el
;; The Early Init
;; :PROPERTIES:
;; :CUSTOM_ID: the-early-init
;; :END:

;; Emacs has/had things that we want to configure BEFORE initialization, as it were.

;; So for that we get the [[info:emacs#Early Init File][Early Init File]](info), AKA [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Early-Init-File.html][early-init.el]](html).


;; [[file:README.org::*The Early Init][The Early Init:1]]
(setq package-enable-at-startup nil)
;; The Early Init:1 ends here
